const MenuData = {
  shopName: "ポテポテポテト",

  organization: "基礎スキー部",

  description:
    "基礎スキー部です！基礎スキーとは滑りの綺麗さやかっこよさで競うスキーです。私たちはオフシーズンはインラインスケート、冬は居候や合宿を行いつつ、たくさんスキーを滑っています。今回の学祭ではポテトを売ります！小腹が空いた時やおやつにいかがですか？色々な味をみんなで分け合うのもおすすめです。ぜひポテポテポテトのお店にお越しください！",

  focusTitle: "メニュー紹介",

  menu: [
    {
      category: "フレーバー",
      type: "",
      items: [
        {
          name: "しお",
        },
        {
          name: "コンソメ",
        },
        {
          name: "のりしお",
        },
        {
          name: "チーズ",
        },
      ],
    },
  ],
};

export default MenuData;