const MenuData = {
  shopName: "唐揚げ＆ポテト",

  organization: "ギター部",

  productDescription:
    "揚げたてアツアツ！みんな大好き定番メニュー！外はカリッと、中はジューシーな唐揚げと、ホクホクで香ばしいフライドポテトをご用意しました！小腹が空いたときにも、友達との食べ歩きにもぴったり！揚げたてのおいしさをぜひ味わってください！",

  organizationDescription:
    "ギター部は、学年関係なく仲が良く、分け隔てなく楽しく活動しています！一人ひとり個性があり、好きなことや性格もそれぞれ違いますが、だからこそ一緒にいると新しい発見があって楽しいのが魅力です。個性豊かなメンバーが集まっているからこそ生まれる、明るく温かい雰囲気を大切にしながら、みんなで楽しくギターを演奏しています！",

  menu: [
    {
      name: "唐揚げ",
    },
    {
      name: "フライドポテト",
    },
  ],
};

export default MenuData;