"use client";
import React from "react";
import "./Timetable.css";

const timetableData = [
  {
    day: "１日目",
    items: [
      ["10:30〜10:45", "オープニング"],
      ["10:45〜11:10", "ダンサー1組目"],
      ["11:10〜11:15", "準備"],
      ["11:15〜11:45", "出演者様"],
      ["11:45〜11:50", "準備"],
      ["11:50〜12:10", "○×ゲーム"],
      ["12:10〜12:20", "準備"],
      ["12:20〜12:50", "アイドル1組目"],
      ["12:50〜13:20", "歌王"],
      ["13:20〜13:40", "出演者様"],
      ["13:40〜13:45", "準備"],
      ["13:45〜14:15", "芸人1組目"],
      ["14:15〜14:25", "準備"],
      ["14:25〜14:55", "芸人2組目"],
      ["14:55〜15:05", "エンディング"],
      ["15:05〜16:00", "セッティング・リハーサル"],
      ["16:00〜16:10", "オープニング"],
      ["16:10〜17:10", "演者様①演奏"],
      ["17:10〜17:45", "セッティング・リハーサル"],
      ["17:45〜18:45", "演者様②演奏"],
      ["18:45〜18:55", "片付け"],
      ["18:55〜19:55", "ビンゴゲーム"],
      ["19:55〜20:00", "エンディング"],
    ],
  },
  {
    day: "２日目",
    items: [
      ["10:30〜10:45", "オープニング"],
      ["10:45〜11:15", "アイドル1組目"],
      ["11:15〜11:45", "アイドル2組目"],
      ["11:45〜12:15", "歌王"],
      ["12:15〜12:50", "アイドル3組目"],
      ["12:50〜13:20", "アイドル4組目"],
      ["13:20〜13:30", "エンディング"],
      ["13:30〜15:00", "出演者様"],
      ["17:00〜17:05", "オープニング"],
      ["17:05〜17:15", "工科展・模擬店の表彰"],
      ["17:15〜17:30", "後夜ダンス①"],
      ["17:30〜17:35", "準備"],
      ["17:35〜18:10", "Laugh & Music"],
      ["17:35〜18:10", "アイドル5組目"], // ← 重複
      ["18:10〜18:25", "後夜ダンス②"],
      ["18:25〜18:30", "準備"],
      ["18:30〜19:35", "ビンゴゲーム"],
      ["19:35〜20:00", "火舞"],
      ["20:00〜20:05", "委員長挨拶"],
      ["20:05〜20:10", "仕掛け花火"],
      ["未定", "打ち上げ花火"],
      ["20:10〜", "ファイヤートーチ"],
    ],
  },
];

const ZentaiTimetable = () => {
  return (
    <section className="Home-timetable-section">
      <h2 className="Home-section-title">タイムテーブル</h2>

      <div className="Home-box">
        {timetableData.map((dayData, index) => (
          <div key={index}>
            <h3 className="Home-day-title">{dayData.day}</h3>

            <table className="Home-table">
              

              <tbody>
                {dayData.items.map((item, i) => (
                  <tr key={i}>
                    <td>{item[0]}</td>
                    <td>{item[1]}</td>
                  </tr>
                ))}
              </tbody>
            </table>
          </div>
        ))}
      </div>
    </section>
  );
};

export default ZentaiTimetable;