const MenuData = {

  /* =================================
     基本情報
  ================================= */

  title: "出展概要",

  gameTitle: "ストラックアウト",

  /* =================================
     遊び方
  ================================= */

  rules: [
    "① 初級・中級・上級から階級を選択する",
    "② くじを引く",
    "③ 数字が書いてあるストラックアウトの的に当てて、くじと同じ数にする",
  ],

  ruleNote:
    "※中級・上級は当てた的を足し算して、くじと同じ数にする",


  /* =================================
     クリア特典
  ================================= */

  clearTitle: "クリアした場合",

  clearItems: [
    {
      level: "初級",
      reward: "お菓子プレゼント",
    },
    {
      level: "中級",
      reward: "野球カードまたはお菓子プレゼント",
    },
    {
      level: "上級",
      reward:
        "プロ野球グッズor野球カードorお菓子プレゼント",
    },
  ],


  /* =================================
     参加費
  ================================= */

  feeTitle: "参加費",

  fee: "100円",

  feeNote:
    "※初回に限りSNSフォローで無料",

};


export default MenuData;