const MenuData = {

  shopName: "ハンドボールサークル",

  organization: "ハンドボールサークル",

  productDescription:
    "こんにちはハンドボールサークルです！私たちのサークルは月に数回ハンドボールをしたり、みんなでご飯に行ったりとワイワイキャハキャハ楽しんでいるサークルです！そんな私たちがこの度、黄金のチュロスとGo！Hey！餅！を出店させて頂くことになりました！チュロスの甘さと五平餅のしょっぱさのハーモニーを感じたときにはきっとみなさんスタンディングオベーションでしょう。全米が泣いた。五平餅だけにね(笑)。",

  focusTitle: "お店の紹介",

  menu: [
    {
      type: "五平餅",

      items: [
        {
          name: "五平餅",
          price: "400",
        },
      ],
    },

    {
      type: "チュロス",

      items: [
        {
          name: "黄金のチュロス（5本）",
          price: "400",
        },
      ],
    },
  ],

  flavor: [
    "シュガー",
    "シナモン",
    "きな粉",
    "紅茶",
  ],

};

export default MenuData;