const MenuData = {
  shopName: "からあげ",

  organization: "DJ・DTM部",

  description:
    "こんにちは、DJ• DTM部です!\n私たちは「音楽を作る (DTM) 」と「音楽を繋ぐ (DJ) 」を中心に、日々楽しく活動しています。\n\n【DTM活動】\n火、金曜日の活動日にみんなで作曲を行い、お互いの曲を聴き合ってアドバイスを交換しています。同人音楽即売会(M3) に参加し、部員の楽曲をまとめたCDを制作、販売するのも大きな目標の一つです！\n\n【DJ活動】\n空き時間に機材を使って自由に練習ができます。腕を磨いて外部のイベントに出演したり、自らイベントを主催する部員もいたりと、自分のペースで自由に挑戦できる環境です。",

  focusTitle: "お店の紹介",

  menu: [
    {
      type: "",

      items: [
        {
          name: "からあげ",
          price: "500",
        },
      ],
    },
  ],
};

export default MenuData;